Repository: godotengine/godot-website
Catalog: themes/godotengine/i18n/po/messages.*.po
Languages: es

source: The game engine you've been waiting&nbsp;for.
es: El motor de juegos que estabas esperando.

source: The Godot Engine is a free, all-in-one, cross-platform game engine that makes it easy for you to create 2D and 3D games.
es: Godot Engine es un motor totalmente gratuito y multiplataforma que facilita la creación de juegos en 2D y 3D.

source: Download
es: Descargar

source: Learn more
es: Más información

source: Latest news
es: Últimas noticias

source: More News
es: Más noticias

source: A different way to make games
es: Una forma distinta de hacer juegos

source: Innovative design
es: Diseño innovador

source: Godot's Node and Scene system gives you both power and flexibility to create anything.
es: El sistema de nodos y escenas de Godot es potente y flexible para crear lo que imagines.

source: Use the right language for the job
es: Utiliza el lenguaje que necesites

source: Keep your code modular with an object-oriented API using Godot's own GDScript, C#, C++, or bring your own using GDNative.
es: Mantén tu código modular con una API orientada a objetos utilizando el propio GDScript de Godot, C#, C++, y otros usando GDNative.

source: Dedicated 2D engine
es: Motor 2D dedicado

source: Make crisp and performant 2D games with Godot's dedicated 2D rendering engine with real 2D pixel coordinates and 2D nodes.
es: Crea 2D nítidos y fluidos con el motor de renderizado de Godot. Con coordenadas de píxeles y nodos 2D reales.

source: Simple and powerful 3D
es: 3D poderoso y sencillo

source: Godot's 3D nodes give you everything you need to build, animate, and render your 3D worlds and characters.
es: Los nodos 3D de Godot te ofrecen todo lo que necesitas para construir, animar y renderizar tus mundos y personajes en 3D.

source: Release on all platforms
es: Publica en todas las plataformas

source: Deploy your game on desktop, mobile, and the web in seconds. Godot even supports consoles through third party publishers.
es: Distribuye tus juegos en PC, móviles y web en cuestión de segundos. Godot también es compatible con consolas a través de editoras externas.

source: Open Source
es: Código abierto

source: Truly open development: anyone who contributes to Godot benefits equally from others' contributions.
es: Desarrollo verdaderamente abierto: cualquiera que contribuya a Godot se beneficia por igual de las aportaciones de los demás.

source: Get involved
es: Participa

source: Join the community and help create a game engine that belongs to everybody.
es: Únete a la comunidad y ayuda a crear un motor que nos pertenece a todos.

source: Code
es: Programa

source: If you know how to code, you can help by fixing bugs and working with engine contributors towards the implementation of new features.
es: Si sabes programar, puedes ayudar corrigiendo errores y trabajando con los colaboradores del motor en la implementación de nuevas funciones.

source: Document
es: Documenta

source: Documentation quality is essential in a game engine; help make it better by updating the API reference, writing new guides or submitting corrections.
es: La calidad de la documentación es esencial en un motor de juegos; ayuda a mejorarla actualizando la referencia de la API, escribiendo nuevas guías o enviando correcciones.

source: Report
es: Reporta

source: Found a problem with the engine? Don't forget to report it so that developers can track it down.
es: ¿Has encontrado un problema con el motor? No olvides comunicarlo para que los desarrolladores puedan localizarlo.

source: Donate
es: Dona

source: You don't need to be an engine developer to help Godot. Consider donating to speed up development and make Godot&nbsp Engine even more awesome!
es: No necesitas ser un desarrollador de motores para ayudar a Godot. También puedes donar para acelerar el desarrollo y hacer de Godot un motor aún más impresionante.

source: Sponsored by
es: Patrocinado por

source: and
es: y

source: contributors
es: contribuyentes

source: Godot is a member of the
es: Godot es un miembro de la

source: Kindly hosted by
es: Amablemente hospedado en

source: Website source code on GitHub
es: Código fuente en GitHub

source: Get Godot
es: Usa Godot

source: Web Editor
es: Editor web

source: Public Relations
es: Relaciones Públicas

source: News
es: Noticias

source: Communities and Events
es: Comunidades y Eventos

source: Press Kit
es: Kit de Prensa

source: About Godot
es: Más Godot

source: Features
es: Funciones

source: Showcase
es: Hecho en Godot

source: Education
es: Educación

source: License
es: Licencia

source: Code of Conduct
es: Código de Conducta

source: Privacy Policy
es: Política de Privacidad

source: Project Team
es: Equipo del Proyecto

source: Governance
es: Gobernanza

source: Teams
es: Equipos

source: Extra Resources
es: Recursos

source: Asset Library
es: Librería de Assets

source: Documentation
es: Documentación

source: Code Repository
es: Repositorio

source: Contact us
es: Contáctanos

source: Community
es: Comunidad

source: About
es: Más

source: Learn
es: Aprende

source: Contribute
es: Contribuye
