<?php

return [
    'plugin' => [
        'name' => 'Превод',
        'description' => 'Активира функцията многоезични уебсайтове.',
        'tab' => 'Преводи',
        'manage_locales' => 'Настройка на локация',
        'manage_messages' => 'Настройка на съобщения'
    ],
    'locale_picker' => [
        'component_name' => 'Избор на местоположение',
        'component_description' => 'Показва меню за избор на езика на сайта.',
    ],
    'locale' => [
        'title' => 'Настройка на езици',
        'update_title' => 'Актуализация на език',
        'create_title' => 'Създай език',
        'select_label' => 'Избери език',
        'default_suffix' => 'по подразбиране',
        'unset_default' => '":locale" вече е по подразбиране и не може да бъде изключен по подразбиране.',
        'disabled_default' => '":locale" е забранен и не може да бъде зададен по подразбиране.',
        'name' => 'Име',
        'code' => 'Код',
        'is_default' => 'По подразбиране',
        'is_default_help' => 'Основният език представлява съдържанието на сайта преди превод.',
        'is_enabled' => 'Включен',
        'is_enabled_help' => 'Изключените езици няма да са налични за преглед в сайта.',
        'not_available_help' => 'Не съществуват други езици за настройка.',
        'hint_locales' => 'Създайте нови езици за превод на съдържанието на сайта. Основният език представлява съдържанието, преди той да бъде преведен.',
    ],
    'messages' => [
        'title' => 'Преведени Съобщения',
        'description' => 'Актуализарай Съобщения',
        'clear_cache_link' => 'Изтрий кеш-паметта',
        'clear_cache_loading' => 'Изчистване кеша на приложението...',
        'clear_cache_success' => 'Кеш кеш-паметта успешно изтрита!',
        'clear_cache_hint' => 'Може да е необходимо да кликнете на бутона <strong>Изтрий кеш-паметта</strong> за да видите промените на вашата страница.',
        'scan_messages_link' => 'Сканирай за съобщения',
        'scan_messages_loading' => 'Сканиране за нови съобщения...',
        'scan_messages_success' => 'Темата е сканирана успешно!',
        'scan_messages_hint' => 'Ако кликнете на <strong>Сканирай за съобщения</strong> това ще провери темата за нови съобщения (изречения) за превод.',
        'hint_translate' => 'Тук може да превеждате съобщенията (изреченията) на самият сайт, полетата ще се запазят автоматично.',
        'hide_translated' => 'Скрий преведените',
    ],
];